AdityaDk10/UbicompLab-Pic24/main.c
    return 1;  // Pattern matches (timing warning is separate)
}

// Delete user from database, returns 1 on success, 0 on failure
uint8_t DeleteUser(int16_t userId) {
    int8_t index = FindUser(userId);
    if (index == -1) {
        return 0;  // User not found
    }
    
            // Mark slot as inactive and clear data
    userDatabase[index].isActive = 0;
    userDatabase[index].userId = 0;
    userDatabase[index].failedAttempts = 0;
    userDatabase[index].isLoggedIn = 0;
    for (uint8_t j = 0; j < PATTERN_LENGTH; j++) {
        userDatabase[index].pattern[j] = 0;
    }
    for (uint8_t j = 0; j < PATTERN_LENGTH - 1; j++) {
        userDatabase[index].timing[j] = 0;
    }
    
    userCount--;  // Decrement user count
    return 1;  // Success
}

// ==================== PATTERN DISPLAY ====================

// Draw the 5 button positions as dots on screen
void DrawPatternGrid() {
    SetColor(WHITE);
    for (uint8_t i = 0; i < 5; i++) {
        DrawFilledCircle(buttonX[i], buttonY[i], 3);
    }
}

// Draw pattern lines connecting buttons
void DrawPatternLines(uint8_t* pattern, uint8_t length) {
    SetColor(WHITE);
    for (uint8_t i = 1; i < length; i++) {
        uint8_t prev = pattern[i-1] - 1;  // Convert 1-5 to 0-4 index
        uint8_t curr = pattern[i] - 1;
        DrawLine(buttonX[prev], buttonY[prev], buttonX[curr], buttonY[curr]);
    }
}

// Draw current pattern state (grid + lines so far)
void UpdatePatternDisplay(uint8_t* pattern, uint8_t length) {
    SetColor(BLACK);
    ClearDevice();
    DrawPatternGrid();
    if (length > 0) {
        DrawPatternLines(pattern, length);
        // Highlight last touched button
        uint8_t last = pattern[length-1] - 1;
        DrawFilledCircle(buttonX[last], buttonY[last], 5);
    }
}

// ==================== TIMER DELAY ====================
void delay(unsigned int milliseconds) {
    T1CONbits.TCKPS = 0b11; // Prescale 1:256
    PR1 = 47; TMR1 = 0; // Reset timer counter
    T1CONbits.TON = 1; // Turn on Timer1
    unsigned int count = 0;
    while (count < milliseconds) {
        while (!IFS0bits.T1IF); // Wait for Timer1 interrupt flag
        IFS0bits.T1IF = 0; // Clear Timer1 interrupt flag
        count++;
    }
    T1CONbits.TON = 0; // Turn off Timer1
}

// ==================== UI HELPER FUNCTIONS ====================

// Display text centered horizontally on screen
void DisplayCentered(const char* text) {
    SetColor(BLACK);
    ClearDevice();
    SetColor(WHITE);
    
    uint8_t textWidth = GetStringWidth(text);
    int16_t xPos = (DISP_HOR_RESOLUTION - textWidth) / 2;
    int16_t yPos = 24; // Middle page
    
    DrawString(xPos, yPos, text);
}

// Display message for specified duration (in seconds)
void ShowMessage(const char* text, uint8_t seconds) {
    DisplayCentered(text);
    delay(seconds * 1000);
}

// Blink RGB LED with given color a number of times
void BlinkRGB(uint8_t r, uint8_t g, uint8_t b, uint8_t times, uint16_t onMs, uint16_t offMs) {
    for (uint8_t i = 0; i < times; i++) {
        SetRGBs(r, g, b);       // LED on with requested color
        delay(onMs);
        SetRGBs(0, 0, 0);       // LED off
        delay(offMs);
    }
}

// Display two lines of text
void DisplayTwoLines(const char* line1, const char* line2) {
    SetColor(BLACK);
    ClearDevice();
    SetColor(WHITE);
    
    uint8_t width1 = GetStringWidth(line1);
    int16_t x1 = (DISP_HOR_RESOLUTION - width1) / 2;
    DrawString(x1, 16, line1);
    
    uint8_t width2 = GetStringWidth(line2);
    int16_t x2 = (DISP_HOR_RESOLUTION - width2) / 2;
    DrawString(x2, 40, line2);
}

// Draw main menu with a rectangular highlight around the selected option
// selectedIndex: 0 = REGISTER, 1 = LOGIN, 2 = DELETE, 3 = LIST
void DrawMainMenu(uint8_t selectedIndex) {
    SetColor(BLACK);
    ClearDevice();
    SetColor(WHITE);

    const char* regText = "REGISTER";
    const char* loginText = "LOGIN";
    const char* deleteText = "DELETE";
    const char* listText = "LIST";

    // Y positions for the four options (adjusted spacing to fit all 4 items)
    const int16_t yReg = 6;
    const int16_t yLogin = 22;
    const int16_t yDelete = 38;
    const int16_t yList = 54;

    // Draw text centered
    uint8_t widthReg = GetStringWidth(regText);
    int16_t xReg = (DISP_HOR_RESOLUTION - widthReg) / 2;
    DrawString(xReg, yReg, regText);

    uint8_t widthLogin = GetStringWidth(loginText);
    int16_t xLogin = (DISP_HOR_RESOLUTION - widthLogin) / 2;
    DrawString(xLogin, yLogin, loginText);

    uint8_t widthDelete = GetStringWidth(deleteText);
    int16_t xDelete = (DISP_HOR_RESOLUTION - widthDelete) / 2;
    DrawString(xDelete, yDelete, deleteText);

    uint8_t widthList = GetStringWidth(listText);
    int16_t xList = (DISP_HOR_RESOLUTION - widthList) / 2;
    DrawString(xList, yList, listText);

    // Draw highlight rectangle around the selected option
    const int8_t paddingX = 4;
    const int8_t paddingY = 2;  // Reduced to prevent overlap with menu items below
    int16_t rectX, rectY, rectW, rectH;

    if (selectedIndex == 0) {
        rectX = xReg - paddingX;
        rectY = yReg - paddingY;
        rectW = widthReg + 2 * paddingX;
        rectH = 12 + 2 * paddingY;  // Approximate text height
    } else if (selectedIndex == 1) {
        rectX = xLogin - paddingX;
        rectY = yLogin - paddingY;
        rectW = widthLogin + 2 * paddingX;
        rectH = 12 + 2 * paddingY;  // Approximate text height
    } else if (selectedIndex == 2) {
        rectX = xDelete - paddingX;
        rectY = yDelete - paddingY;
        rectW = widthDelete + 2 * paddingX;
        rectH = 12 + 2 * paddingY;  // Approximate text height
    } else {  // selectedIndex == 3 (LIST)
        rectX = xList - paddingX;
        rectY = yList - paddingY;
        rectW = widthList + 2 * paddingX;
        rectH = 12 + 2 * paddingY;  // Approximate text height
    }

    // Draw rectangle outline using four lines
    DrawLine(rectX, rectY, rectX + rectW, rectY);               // top
    DrawLine(rectX, rectY + rectH, rectX + rectW, rectY + rectH); // bottom
    DrawLine(rectX, rectY, rectX, rectY + rectH);               // left
    DrawLine(rectX + rectW, rectY, rectX + rectW, rectY + rectH); // right
}

