AdityaDk10/UbicompLab-Pic24/main.c
// Draw LIST submenu with a rectangular highlight around the selected option
// selectedIndex: 0 = REGISTERED, 1 = LOGGED IN, 2 = LOCKED, 3 = DELETED
void DrawListSubMenu(uint8_t selectedIndex) {
    SetColor(BLACK);
    ClearDevice();
    SetColor(WHITE);

    const char* regUsersText = "REGISTERED";
    const char* loggedInText = "LOGGED IN";
    const char* lockedText = "LOCKED";
    const char* deletedText = "DELETED";

    // Y positions for the four options (adjusted spacing to fit all 4 items)
    const int16_t yReg = 6;
    const int16_t yLogged = 22;
    const int16_t yLocked = 38;
    const int16_t yDeleted = 54;

    // Draw text centered
    uint8_t widthReg = GetStringWidth(regUsersText);
    int16_t xReg = (DISP_HOR_RESOLUTION - widthReg) / 2;
    DrawString(xReg, yReg, regUsersText);

    uint8_t widthLogged = GetStringWidth(loggedInText);
    int16_t xLogged = (DISP_HOR_RESOLUTION - widthLogged) / 2;
    DrawString(xLogged, yLogged, loggedInText);

    uint8_t widthLocked = GetStringWidth(lockedText);
    int16_t xLocked = (DISP_HOR_RESOLUTION - widthLocked) / 2;
    DrawString(xLocked, yLocked, lockedText);

    uint8_t widthDeleted = GetStringWidth(deletedText);
    int16_t xDeleted = (DISP_HOR_RESOLUTION - widthDeleted) / 2;
    DrawString(xDeleted, yDeleted, deletedText);

    // Draw highlight rectangle around the selected option
    const int8_t paddingX = 4;
    const int8_t paddingY = 2;
    int16_t rectX, rectY, rectW, rectH;

    if (selectedIndex == 0) {
        rectX = xReg - paddingX;
        rectY = yReg - paddingY;
        rectW = widthReg + 2 * paddingX;
        rectH = 12 + 2 * paddingY;
    } else if (selectedIndex == 1) {
        rectX = xLogged - paddingX;
        rectY = yLogged - paddingY;
        rectW = widthLogged + 2 * paddingX;
        rectH = 12 + 2 * paddingY;
    } else if (selectedIndex == 2) {
        rectX = xLocked - paddingX;
        rectY = yLocked - paddingY;
        rectW = widthLocked + 2 * paddingX;
        rectH = 12 + 2 * paddingY;
    } else {  // selectedIndex == 3 (DELETED)
        rectX = xDeleted - paddingX;
        rectY = yDeleted - paddingY;
        rectW = widthDeleted + 2 * paddingX;
        rectH = 12 + 2 * paddingY;
    }

    // Draw rectangle outline using four lines
    DrawLine(rectX, rectY, rectX + rectW, rectY);               // top
    DrawLine(rectX, rectY + rectH, rectX + rectW, rectY + rectH); // bottom
    DrawLine(rectX, rectY, rectX, rectY + rectH);               // left
    DrawLine(rectX + rectW, rectY, rectX + rectW, rectY + rectH); // right
}

// Display list of users based on filter type
// filterType: 0 = all registered, 1 = logged in, 2 = locked, 3 = deleted
void DisplayUserList(uint8_t filterType) {
    SetColor(BLACK);
    ClearDevice();
    SetColor(WHITE);
    
    // Set header based on filter type
    const char* header = "";
    if (filterType == 0) {
        header = "REGISTERED:";
    } else if (filterType == 1) {
        header = "LOGGED IN:";
    } else if (filterType == 2) {
        header = "LOCKED:";
    } else {
        header = "DELETED:";
    }
    
    uint8_t headerWidth = GetStringWidth(header);
    int16_t xHeader = (DISP_HOR_RESOLUTION - headerWidth) / 2;
    DrawString(xHeader, 4, header);
    
    // Count and display users
    uint8_t displayCount = 0;
    uint8_t shownCount = 0;
    
    for (uint8_t i = 0; i < 10 && shownCount < 4; i++) {
        uint8_t shouldDisplay = 0;
        
        if (filterType == 0) {
            // Show all registered users
            shouldDisplay = userDatabase[i].isActive;
        } else if (filterType == 1) {
            // Show logged in users
            shouldDisplay = userDatabase[i].isActive && userDatabase[i].isLoggedIn;
        } else if (filterType == 2) {
            // Show locked users (3 failed attempts)
            shouldDisplay = userDatabase[i].isActive && userDatabase[i].failedAttempts >= 3;
        } else {
            // Deleted users - these are removed from database, so show message
            shouldDisplay = 0;
        }
        
        if (shouldDisplay) {
            char userLine[20];
            sprintf(userLine, "ID: %02d", userDatabase[i].userId);
            DrawString(8, 18 + displayCount * 12, userLine);
            displayCount++;
            shownCount++;
        }
    }
    
    // Handle special cases
    if (filterType == 3) {
        // Deleted users are removed from database
        DrawString(8, 18, "NOT TRACKED");
        DrawString(8, 30, "(REMOVED FROM");
        DrawString(8, 42, "DATABASE)");
    } else if (shownCount == 0 && displayCount == 0) {
        // No users found for this filter
        DrawString(8, 18, "NONE");
    }
    
    // Wait for button press to return
    delay(2000);
    WaitForButton();
}


// ==================== PATTERN INPUT ====================

// Check if button is already in pattern (no repeats)
uint8_t IsInPattern(uint8_t* pattern, uint8_t length, uint8_t button) {
    for (uint8_t i = 0; i < length; i++) {
        if (pattern[i] == button) return 1;
    }
    return 0;
}

// Collect pattern using swipe detection (like ball movement)
// Also captures timing between button presses in milliseconds
void CollectPattern(uint8_t* pattern, uint16_t* timing) {
    uint8_t patternLen = 0;
    int16_t aggr[5] = {0, 0, 0, 0, 0};
    uint8_t lastButton = 0xFF;  // Last button added to pattern
    const int16_t THRESHOLD = 6;
    const uint16_t timeout = 10;
    
    uint32_t lastButtonTime = 0;  // Time when last button was added (in loop iterations)
    uint32_t currentTime = 0;     // Current time counter (in loop iterations)
    
    // Initialize timing array
    for (uint8_t i = 0; i < PATTERN_LENGTH - 1; i++) {
        timing[i] = 0;
    }
    
    // Show initial grid
    SetColor(BLACK);
    ClearDevice();
    DrawPatternGrid();
    
    // Collect pattern until 5 buttons
    while (patternLen < PATTERN_LENGTH) {
        ReadCTMU();
        
        // Update aggregate values (same as ball movement logic)
        for (uint8_t i = 0; i < 5; i++) {
            if (buttons[i]) aggr[i]++;
            else aggr[i]--;
            if (aggr[i] < 0) aggr[i] = 0;
            if (aggr[i] > 30) aggr[i] = 30;
        }
        
        // Find which button currently has highest aggregate
        int16_t maxVal = THRESHOLD;
        uint8_t currentButton = 0xFF;
        for (uint8_t i = 0; i < 5; i++) {
            if (aggr[i] > maxVal) {
                maxVal = aggr[i];
                currentButton = i;
            }
        }
        
        // If touching a valid button
        if (currentButton != 0xFF) {
            uint8_t buttonNum = currentButton + 1;  // Convert 0-4 to 1-5
            
            // Check if it's a NEW button (not the same as last, not already in pattern)
            if (currentButton != lastButton && !IsInPattern(pattern, patternLen, buttonNum)) {
                // Calculate timing since last button (if not first button)
                if (patternLen > 0) {
                    // Time difference in loop iterations, convert to milliseconds
                    uint32_t timeDiff = currentTime - lastButtonTime;
                    timing[patternLen - 1] = (uint16_t)(timeDiff * timeout);  // Convert to milliseconds
                }
                
                // Add to pattern
                pattern[patternLen] = buttonNum;
                patternLen++;
                lastButton = currentButton;
                lastButtonTime = currentTime;  // Record time when this button was added
                
