AdityaDk10/UbicompLab-Pic24/main.c
        } else if (selectedIndex == 2) {  // DELETE selected
            // Delete user flow
            ShowMessage("DELETE MENU", 1);
            ShowMessage("LOADING...", 2);
            
            // Check if database is empty
            if (userCount == 0) {
                DisplayTwoLines("FIRST REGISTER", "USERS!");
                delay(3000);
                ShowMessage("REDIRECTING...", 1);
                continue;  // Back to menu
            }
            
            // Prompt for ID
            DisplayTwoLines("PLEASE ENTER", "ID");
            delay(2000);
            
            // Collect 2-digit ID (automatically proceeds)
            int16_t userId = CollectDigits(2, "ID");
            
            // Check if user exists
            int8_t userIndex = FindUser(userId);
            if (userIndex == -1) {
                ShowMessage("CHECKING...", 1);
                // Failure: invalid user ID -> RED blink
                BlinkRGB(255, 0, 0, 3, 200, 200);
                DisplayTwoLines("INVALID", "USER ID!");
                delay(3000);
                ShowMessage("REDIRECTING...", 1);
                continue;  // Back to menu
            }
            
            // Prompt for Pattern (authentication required)
            DisplayTwoLines("AUTHENTICATE", "TO DELETE");
            delay(2000);
            
            // Collect 5-button pattern (swipe-based)
            uint8_t pattern[PATTERN_LENGTH];
            uint16_t timing[PATTERN_LENGTH - 1];
            CollectPattern(pattern, timing);
            
            // Validate credentials
            ShowMessage("CHECKING...", 2);
            uint8_t timingWarning = 0;
            if (ValidateLogin(userId, pattern, timing, &timingWarning)) {
                // Check if timing warning should be shown
                if (timingWarning) {
                    // Show timing warning but still allow deletion
                    DisplayTwoLines("TIMING WARNING", "");
                    delay(2000);
                }
                
                // Authentication successful - show confirmation alert
                DisplayTwoLines("DELETE USER?", "CENTER=YES");
                delay(2000);
                
                // Wait for confirmation (CENTER = confirm, any other = cancel)
                uint8_t confirmBtn = WaitForButton();
                
                if (confirmBtn == 4) {  // CENTER = YES, confirm deletion
                    // Delete the user
                    if (DeleteUser(userId)) {
                        // Success: deletion -> GREEN blink
                        BlinkRGB(0, 255, 0, 3, 200, 200);
                        DisplayTwoLines("USER", "DELETED!");
                        delay(2000);
                    } else {
                        // Failure: deletion failed -> RED blink
                        BlinkRGB(255, 0, 0, 3, 200, 200);
                        DisplayTwoLines("DELETE", "FAILED!");
                        delay(2000);
                    }
                } else {
                    // User cancelled - no action
                    DisplayTwoLines("CANCELLED", "");
                    delay(2000);
                }
            } else {
                // Authentication failed - don't allow deletion
                // Failure: wrong pattern -> RED blink
                BlinkRGB(255, 0, 0, 3, 200, 200);
                DisplayTwoLines("AUTH FAILED!", "");
                delay(3000);
            }
            ShowMessage("REDIRECTING...", 1);
            
        } else if (selectedIndex == 3) {  // LIST selected
            // LIST submenu navigation
            ShowMessage("LIST MENU", 1);
            
            // Check if database is empty
            if (userCount == 0) {
                DisplayTwoLines("NO USERS", "REGISTERED!");
                delay(3000);
                ShowMessage("REDIRECTING...", 1);
                continue;  // Back to menu
            }
            
            // LIST submenu with navigable highlight box:
            // Button mapping (index from WaitForButton):
            //   0 = UP, 2 = DOWN, 4 = CENTER (select), 3 = LEFT (back)
            uint8_t listSubIndex = 0;   // 0 = REGISTERED, 1 = LOGGED IN, 2 = LOCKED, 3 = DELETED
            uint8_t inListSubMenu = 1;
            
            while (inListSubMenu) {
                DrawListSubMenu(listSubIndex);
                uint8_t btn = WaitForButton();
                
                if (btn == 0) {          // UP
                    if (listSubIndex > 0) {
                        listSubIndex--;
                    }
                } else if (btn == 2) {   // DOWN
                    if (listSubIndex < 3) {
                        listSubIndex++;
                    }
                } else if (btn == 4) {   // CENTER = select
                    inListSubMenu = 0;
                } else if (btn == 3) {   // LEFT = back to main menu
                    inListSubMenu = 0;
                    listSubIndex = 255;  // Special value to indicate back
                }
                // Other buttons (1=RIGHT) are ignored in menu
            }
            
            // If user selected an option (not back), display the list
            if (listSubIndex != 255) {
                DisplayUserList(listSubIndex);
            }
            
            ShowMessage("REDIRECTING...", 1);
    }
    }
    
    RGBTurnOffLED();
}
